import qqfaceList from "../../../static/qqface/json/translateqqface.json";
//单个表情符替换成img标签
function imgHTML(info) {
  const imgSrc = qqfaceList.find(item => item.value == info).icon;
  return `<img draggable="false" src="${imgSrc}">`;
}
//字符串内的img标签替换成src属性转换的表情符
function replaceImg(text) {
  return text.replace(/<img [^>]*src=['"]([^'"]+)[^>]*>/gi, function(
    match,
    capture
  ) {
    //capture,返回每个匹配的字符串
    return qqfaceList.find(item => item.icon == capture).value;
  });
}
//字符串内的表情符批量替换成img标签
function replaceTxt(strCont) {
  for (var i in qqfaceList) {
    var item = qqfaceList[i];
    var strimg = `<img draggable="false" src="${item.icon}">`;
    var reg = new RegExp("\\" + item.value, "g");
    strCont = strCont.replace(reg, strimg);
  }
  return strCont;
}
const emojiList = [
  [
    "[微笑]",
    "[撇嘴]",
    "[色]",
    "[发呆]",
    "[得意]",
    "[流泪]",
    "[害羞]",
    "[闭嘴]"
  ],
  [
    "[睡]",
    "[大哭]",
    "[尴尬]",
    "[发怒]",
    "[调皮]",
    "[呲牙]",
    "[惊讶]",
    "[难过]"
  ],
  [
    "[冷汗]",
    "[抓狂]",
    "[吐]",
    "[偷笑]",
    "[可爱]",
    "[白眼]",
    "[傲慢]",
    "[饥饿]"
  ],
  ["[困]", "[惊恐]", "[流汗]", "[悠闲]", "[酷]", "[憨笑]", "[奋斗]", "[咒骂]"],
  ["[疑问]", "[嘘]", "[晕]", "[衰]", "[骷髅]", "[敲打]", "[再见]", "[擦汗]"],
  [
    "[抠鼻]",
    "[鼓掌]",
    "[糗大了]",
    "[坏笑]",
    "[疯了]",
    "[左哼哼]",
    "[右哼哼]",
    "[哈欠]"
  ],
  [
    "[鄙视]",
    "[委屈]",
    "[快哭了]",
    "[阴险]",
    "[亲亲]",
    "[吓]",
    "[可怜]",
    "[西瓜]"
  ],
  [
    "[啤酒]",
    "[篮球]",
    "[乒乓]",
    "[菜刀]",
    "[饭]",
    "[猪头]",
    "[玫瑰]",
    "[凋谢]"
  ],
  ["[蛋糕]", "[闪电]", "[足球]", "[瓢虫]", "[咖啡]", "[饭]", "[炸弹]", "[刀]"],
  ["[便便]", "[爱心]", "[心碎]", "[嘴唇]", "[礼物]", "[拥抱]", "[强]", "[弱]"],
  ["[胜利]", "[抱拳]", "[拳头]", "[差劲]", "[爱你]", "[NO]", "[OK]", "[月亮]"],
  [
    "[太阳]",
    "[勾引]",
    "[握手]",
    "[爱情]",
    "[飞吻]",
    "[跳跳]",
    "[发抖]",
    "[怄火]"
  ],
  [
    "[转圈]",
    "[磕头]",
    "[回头]",
    "[激动]",
    "[乱舞]",
    "[献吻]",
    "[右太极]",
    "[跳跳]"
  ]
];
export { imgHTML, replaceImg, emojiList, replaceTxt };
/*   const list = [
    "微笑",
    "撇嘴",
    "色",
    "发呆",
    "得意",
    "流泪",
    "害羞",
    "闭嘴",
    "睡",
    "大哭",
    "尴尬",
    "发怒",
    "调皮",
    "呲牙",
    "惊讶",
    "难过",
    "酷",
    "冷汗",
    "抓狂",
    "吐",
    "偷笑",
    "可爱",
    "白眼",
    "傲慢",
    "饥饿",
    "困",
    "惊恐",
    "流汗",
    "憨笑",
    "大兵",
    "奋斗",
    "咒骂",
    "疑问",
    "嘘",
    "晕",
    "折磨",
    "衰",
    "骷髅",
    "敲打",
    "再见",
    "擦汗",
    "抠鼻",
    "鼓掌",
    "糗大了",
    "坏笑",
    "左哼哼",
    "右哼哼",
    "哈欠",
    "鄙视",
    "委屈",
    "快哭了",
    "阴险",
    "亲亲",
    "吓",
    "可怜",
    "菜刀",
    "西瓜",
    "啤酒",
    "篮球",
    "乒乓",
    "咖啡",
    "饭",
    "猪头",
    "玫瑰",
    "凋谢",
    "示爱",
    "爱心",
    "心碎",
    "蛋糕",
    "闪电",
    "炸弹",
    "刀",
    "足球",
    "瓢虫",
    "便便",
    "月亮",
    "太阳",
    "礼物",
    "拥抱",
    "强",
    "弱",
    "握手",
    "胜利",
    "抱拳",
    "勾引",
    "拳头",
    "差劲",
    "爱你",
    "NO",
    "OK",
    "爱情",
    "飞吻",
    "跳跳",
    "发抖",
    "怄火",
    "转圈",
    "磕头",
    "回头",
    "跳绳",
    "挥手",
    "激动",
    "街舞",
    "献吻",
    "左太极",
    "右太极"
  ]; */
//return `<img draggable="false" src="https://res.wx.qq.com/mpres/htmledition/images/icon/emotion/102.gif">`;
